[M_Ep10_BirdISTheWord MissionDefinition]
TurnInDescription="The cost was high, but you successfully secured a way past the first obstacle to [place]Control Core Angel[-place]."

[M_Ep10_BirdISTheWord:DamageBotsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. There's a problem, though -- the Claptrap upgrade is stored on a microchip in the collar of Bloodwing, Mordecai's bird. During an ambush in [place]Tundra Express[-place], Hyperion troops kidnapped Bloodwing. Mordecai explained that Bloodwing is being held within the bowels (heh) of the [place]Wildlife Exploitation Preserve[-place]. If you save Bloodwing, you'll get your Claptrap upgrade. First, however, you need a way into the Preserve itself. The back door is locked, but Mordecai has suggested wounding some Hyperion loaders outside the entrance. The surveyor repair bots will have to exit the Preserve to heal the crippled bots, and, in so doing, will open the entrance to the Preserve for you."

[M_Ep10_BirdISTheWord:DefeatBloodWingBossSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. There's a problem, though -- the Claptrap upgrade is stored on a microchip in the collar of Bloodwing, Mordecai's bird. Unfortunately, Bloodwing has been mutated by Eridium into a large, insane, elementally powered killing machine. Mordecai has instructed you to weaken her enough that he can hit her with a tranquilizer dart."

[M_Ep10_BirdISTheWord:DeliverUpgradeClaptrapSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. Despite a very high cost, you managed to acquire the Claptrap upgrade from the late Bloodwing. After swearing vengeance against Handsome Jack, Mordecai instructed you to give Claptrap the software upgrade."

[M_Ep10_BirdISTheWord:FindHoldingCellsPlusOptionalSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. There's a problem, though -- the Claptrap upgrade is stored on a microchip in the collar of Bloodwing, Mordecai's bird. During an ambush in [place]Tundra Express[-place], Hyperion troops kidnapped Bloodwing. Mordecai explained that Bloodwing is being held within the bowels (heh) of the [place]Wildlife Exploitation Preserve[-place]. If you save Bloodwing, you'll get your Claptrap upgrade."

[M_Ep10_BirdISTheWord:FindHoldingCellsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Rescue Bloodwing from the Preserve's holding cells."
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. There's a problem, though -- the Claptrap upgrade is stored on a microchip in the collar of Bloodwing, Mordecai's bird. During an ambush in [place]Tundra Express[-place], Hyperion troops kidnapped Bloodwing. Mordecai explained that Bloodwing is being held within the bowels (heh) of the [place]Wildlife Exploitation Preserve[-place]. If you save Bloodwing, you'll get your Claptrap upgrade. Mordecai believes that Bloodwing is interned in the Preserve's holding cells."

[M_Ep10_BirdISTheWord:FindMordecaiSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel AI. To get to [place]Control Core Angel[-place], however, you will have to fight your way through three obstacles. The first obstacle, a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a security upgrade. Mordecai, who has spent much of the last five years spying on Hyperion and stealing their stuff, probably has what you need."

[M_Ep10_BirdISTheWord:GetClaptrapUpgradeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. There's a problem, though -- the Claptrap upgrade is stored on a microchip in the collar of Bloodwing, Mordecai's bird. Though driven mad by Eridium poisoning, Bloodwing is safe -- with your help, Mordecai tranquilized her. Now, you need only get the Claptrap upgrade from her collar."

[M_Ep10_BirdISTheWord:GetslagsampleforTannis MissionObjectiveDefinition]
ProgressMessage="Collect slag samples"

[M_Ep10_BirdISTheWord:GoToPandoraParkSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="To stop Jack from awakening the Warrior, you will need to shut down the Guardian Angel AI. To get to [place]Control Core Angel[-place], however, you will have to fight your way through three obstacles. The first obstacle, a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a security upgrade. Mordecai, who has spent much of the last five years spying on Hyperion and stealing their stuff, probably has what you need. Roland has sent you to the [place]Wildlife Exploitation Preserve[-place] to get started."

[M_Ep10_BirdISTheWord:InfiltrateLabsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The first obstacle to [place]Control Core Angel[-place], a Hyperion security field, can only be shut down by Hyperion tech. Roland thinks Claptrap can do the job, but he'll need a software upgrade. There's a problem, though -- the Claptrap upgrade is stored on a microchip in the collar of Bloodwing, Mordecai's bird. During an ambush in [place]Tundra Express[-place], Hyperion troops kidnapped Bloodwing. Mordecai explained that Bloodwing is being held within the bowels (heh) of the [place]Wildlife Exploitation Preserve[-place]. If you save Bloodwing, you'll get your Claptrap upgrade. First, however, you need a way into the Preserve itself. Mordecai suggested infiltrating the Preserve through the dock entrance. "
